In [1]:
import numpy as np
import pandas as pd
import seaborn as sb

In [2]:
#Read csv file
df = pd.read_csv("http://rcs.bu.edu/examples/python/data_analysis/Salaries.csv")

In [3]:
df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [6]:
df.head(10)

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285
7       Prof          A   18       18  Male  126300
8       Prof          A   29       19  Male   94350
9       Prof          A   51       51  Male   57800

In [7]:
df.head(20)

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285
7       Prof          A   18       18  Male  126300
8       Prof          A   29       19  Male   94350
9       Prof          A   51       51  Male   57800

In [8]:
df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [9]:
df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [10]:
df.axes

[RangeIndex(start=0, stop=10, step=1),
 Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')]

In [11]:
df.ndim

2

In [12]:
df.size

60

In [13]:
df.shape

(10, 6)

In [14]:
df.values

array([['Prof', 'B', 56, 49, 'Male', 186960],
       ['Prof', 'A', 12, 6, 'Male', 93000],
       ['Prof', 'A', 23, 20, 'Male', 110515],
       ['Prof', 'A', 40, 31, 'Male', 131205],
       ['Prof', 'B', 20, 18, 'Male', 104800],
       ['Prof', 'A', 20, 20, 'Male', 122400],
       ['AssocProf', 'A', 20, 17, 'Male', 81285],
       ['Prof', 'A', 18, 18, 'Male', 126300],
       ['Prof', 'A', 29, 19, 'Male', 94350],
       ['Prof', 'A', 51, 51, 'Male', 57800]], dtype=object)

# **METHODS**

In [15]:
df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [16]:
df.tail()

        rank discipline  phd  service   sex  salary
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285
7       Prof          A   18       18  Male  126300
8       Prof          A   29       19  Male   94350
9       Prof          A   51       51  Male   57800

In [17]:
df.describe()

            phd    service        salary
count  10.00000  10.000000      10.00000
mean   28.90000  24.900000  110861.50000
std    14.99222  14.517805   34793.26364
min    12.00000   6.000000   57800.00000
25%    20.00000  18.000000   93337.50000
50%    21.50000  19.500000  107657.50000
75%    37.25000  28.250000  125325.00000
max    56.00000  51.000000  186960.00000

In [18]:
df.max()

rank            Prof
discipline         B
phd               56
service           51
sex             Male
salary        186960
dtype: object

In [19]:
df.min()

rank          AssocProf
discipline            A
phd                  12
service               6
sex                Male
salary            57800
dtype: object

In [20]:
df.mean()

phd            28.9
service        24.9
salary     110861.5
dtype: float64

In [21]:
df.median()

phd            21.5
service        19.5
salary     107657.5
dtype: float64

In [22]:
df.std()

phd           14.992220
service       14.517805
salary     34793.263640
dtype: float64

In [25]:
df.sample(5)

        rank discipline  phd  service   sex  salary
8       Prof          A   29       19  Male   94350
6  AssocProf          A   20       17  Male   81285
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400

In [24]:
df.dropna()

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285
7       Prof          A   18       18  Male  126300
8       Prof          A   29       19  Male   94350
9       Prof          A   51       51  Male   57800

# **SELECT A COLUMN FROM DATA SET**

In [28]:
df.phd

0    56
1    12
2    23
3    40
4    20
5    20
6    20
7    18
8    29
9    51
Name: phd, dtype: int64

In [29]:
df["phd"]

0    56
1    12
2    23
3    40
4    20
5    20
6    20
7    18
8    29
9    51
Name: phd, dtype: int64

In [30]:
df.phd.describe()

count    10.00000
mean     28.90000
std      14.99222
min      12.00000
25%      20.00000
50%      21.50000
75%      37.25000
max      56.00000
Name: phd, dtype: float64

In [31]:
df.phd.count()

10

# **GROUPBY METHOD**

In [32]:
df.head(10)

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285
7       Prof          A   18       18  Male  126300
8       Prof          A   29       19  Male   94350
9       Prof          A   51       51  Male   57800

In [33]:
df_rank=df.groupby(["rank"])

In [34]:
df_rank.mean()

                 phd    service         salary
rank
AssocProf  20.000000  17.000000   81285.000000
Prof       29.888889  25.777778  114147.777778

## *FILTER *

In [36]:
df[df.salary>120000]

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
3  Prof          A   40       31  Male  131205
5  Prof          A   20       20  Male  122400
7  Prof          A   18       18  Male  126300